#レッスン11　「関数」の練習問題


# 【問題1】"引数"も"戻り値"も無い関数
# 実行すると「私はPythonを勉強中です！」と表示する関数 introduce() を作成してください。



# 【問題2】 "引数"を使った関数
# nameを引数にして、「こんにちは、◯◯さん！」と表示する関数 greet()を作ってください。
# 例：greet("佐藤")　→ 「こんにちは、佐藤さん！」


# 【問題3】 "引数"を２つ使った関数 
# multiply(a, b) を作成し、a と b を掛けた結果を「結果：〇〇」と表示するプログラムにしてください。
# 例：multiply(3, 5) → 結果：15


# 【問題4】 "戻り値"を使った関数 
# favorite_fruit() を作成し、自分の好きな果物の名前（例：「イチゴ」）を戻り値として返してください。
# 戻り値を変数に入れて print() で表示してみましょう。


# 【問題5】 "引数"と"戻り値"を使った関数
# 関数 calc_tax(price) を作成し、price に渡された金額に10%の消費税を加えた金額を戻り値として返してください。
# 戻り値を使って「税込金額：〇〇円」と表示しましょう。
